Ran Plan for 4 projects:

1. project: `setof-commerce-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `setof-commerce-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
1. project: `setof-commerce-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
1. project: `setof-commerce-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
---

### 1. project: `setof-commerce-ecr-prod` dir: `terraform/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.ecr_web_api.data.aws_caller_identity.current: Reading...
module.ecr_web_api.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr_web_api.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "prod",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "setof-commerce-web-api-prod"
    }

  # module.ecr_web_api.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "setof-commerce-web-api-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-setof-commerce-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-setof-commerce-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_web_api.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "setof-commerce-web-api-prod"
    }

  # module.ecr_web_api.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for setof-commerce-web-api-prod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/setof-commerce-web-api-prod-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ web_api_repository_arn = (known after apply)
+ web_api_repository_url = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecr-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `setof-commerce-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "setof-commerce-cluster-prod"
      + tags     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-cluster-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-ecs-cluster"
        }
      + tags_all = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-cluster-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-ecs-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "setof-commerce-cluster-prod"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # aws_ssm_parameter.cluster_arn will be created
+ resource "aws_ssm_parameter" "cluster_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SetOf Commerce ECS cluster ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/setof-commerce/ecs/cluster-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "setof-commerce-ecs-cluster-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-ecs-cluster-arn"
          + "Project"     = "setof-commerce"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_name will be created
+ resource "aws_ssm_parameter" "cluster_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SetOf Commerce ECS cluster name"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/setof-commerce/ecs/cluster-name"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "setof-commerce-ecs-cluster-name"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-ecs-cluster-name"
          + "Project"     = "setof-commerce"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = (known after apply)
+ cluster_id   = (known after apply)
+ cluster_name = "setof-commerce-cluster-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecs-cluster-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecs-cluster-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. project: `setof-commerce-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.redis will be created
+ resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for ElastiCache Redis"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Redis from ECS tasks"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "setof-commerce-redis-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_ssm_parameter.redis_endpoint will be created
+ resource "aws_ssm_parameter" "redis_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SetOf Commerce Redis endpoint"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/setof-commerce/elasticache/redis-endpoint"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "setof-commerce-redis-endpoint"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-endpoint"
          + "Project"     = "setof-commerce"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.redis_port will be created
+ resource "aws_ssm_parameter" "redis_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SetOf Commerce Redis port"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/setof-commerce/elasticache/redis-port"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "setof-commerce-redis-port"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-port"
          + "Project"     = "setof-commerce"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.redis.aws_cloudwatch_metric_alarm.connections[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "connections" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache setof-commerce-redis-prod - Connection count is too high"
      + alarm_name                            = "setof-commerce-redis-prod-connection-count"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "setof-commerce-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + threshold                             = 1000
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.cpu[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache setof-commerce-redis-prod - CPU utilization is too high"
      + alarm_name                            = "setof-commerce-redis-prod-cpu-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "setof-commerce-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.memory[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "memory" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache setof-commerce-redis-prod - Memory utilization is too high"
      + alarm_name                            = "setof-commerce-redis-prod-memory-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "setof-commerce-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_elasticache_cluster.memcached-or-single-redis[0] will be created
+ resource "aws_elasticache_cluster" "memcached-or-single-redis" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = "single-az"
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "setof-commerce-redis-prod"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:09:00-mon:10:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "setof-commerce-redis-prod-parameter-group"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 1
      + snapshot_window            = "05:00-09:00"
      + subnet_group_name          = "setof-commerce-redis-prod-subnet-group"
      + tags                       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.redis.aws_elasticache_parameter_group.this[0] will be created
+ resource "aws_elasticache_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "setof-commerce-redis-prod-parameter-group"
      + tags        = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-parameter-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-parameter-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "allkeys-lru"
        }
      + parameter {
          + name  = "notify-keyspace-events"
          + value = "Ex"
        }
    }

  # module.redis.aws_elasticache_subnet_group.this will be created
+ resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "setof-commerce-redis-prod-subnet-group"
      + subnet_ids  = (sensitive value)
      + tags        = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-subnet-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-subnet-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + vpc_id      = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_id              = "setof-commerce-redis-prod"
+ redis_port              = 6379
+ redis_security_group_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-elasticache-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-elasticache-prod
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
### 4. project: `setof-commerce-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/setof-commerce/3/default/terraform/ecs-web-api/setof-commerce-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/setof-commerce/3/default/terraform/ecs-web-api": exit status 1
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
module.web_api_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ecr_repository.web_api: Reading...
module.web_api_task_execution_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.redis_endpoint: Reading...
data.aws_ssm_parameter.redis_port: Reading...
data.aws_caller_identity.current: Reading...
module.web_api_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.web_api_task_role.data.aws_region.current: Reading...
module.web_api_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.web_api_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.public_subnets: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.web_api_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ecs_cluster.main: Reading...
module.web_api_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
data.aws_ssm_parameter.public_subnets: Read complete after 0s [id=/shared/network/public-subnets]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/credentials-xNyiOA]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/credentials-xNyiOA|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.logs will be created
  + resource "aws_kms_alias" "logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/setof-commerce-web-api-logs-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.logs will be created
  + resource "aws_kms_key" "logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for SetOf Commerce web-api CloudWatch logs encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/setof-commerce-web-api-prod/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-web-api-logs-kms-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-web-api-logs-kms-prod"
          + "Project"      = "setof-commerce"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
    }

  # aws_lb.web_api will be created
  + resource "aws_lb" "web_api" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "setof-commerce-alb-prod"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags                                                         = {
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-alb-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + tags_all                                                     = {
          + "Environment"  = "prod"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-alb-prod"
          + "Project"      = "setof-commerce"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "setof-commerce"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (sensitive value)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "setof-commerce"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.web_api will be created
  + resource "aws_lb_target_group" "web_api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "setof-commerce-web-api-tg-prod"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"         = "setof-commerce-web-api-tg-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-web-api-tg-prod"
          + "Project"      = "setof-commerce"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # aws_route53_record.web_api will be created
  + resource "aws_route53_record" "web_api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "commerce.set-of.com"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP for redirect"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "setof-commerce-alb-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-alb-sg-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + tags_all               = {
          + "Environment"  = "prod"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "setof-commerce-alb-sg-prod"
          + "Project"      = "setof-commerce"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "setof-commerce"
          + "service_name" = "setof-commerce-web-api"
          + "team"         = "platform-team"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for web-api ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "setof-commerce-web-api-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for web-api ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for web-api ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                          = (known after apply)
      + description                  = "From ALB only"
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + to_port                      = 8080
    }

  # module.web_api_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/setof-commerce-web-api-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for setof-commerce-web-api-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "setof-commerce-web-api-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "setof-commerce-web-api-execution-role-prod-ssm-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy.secrets-manager[0] will be created
  + resource "aws_iam_role_policy" "secrets-manager" {
      + id          = (known after apply)
      + name        = "setof-commerce-web-api-execution-role-prod-secrets-manager"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/credentials-xNyiOA",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "setof-commerce-web-api-execution-role-prod"
    }

  # module.web_api_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for setof-commerce-web-api-task-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "setof-commerce-web-api-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-web-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.web_api_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "setof-commerce-web-api-task-role-prod-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
         
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.